
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>前端知识点 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="classic.html" />
    
    
    <link rel="prev" href="vscode.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="computer.html">
            
                <a href="computer.html">
            
                    
                    Computer
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="vscode.html">
            
                <a href="vscode.html">
            
                    
                    vscode
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.4" data-path="前端知识点.html">
            
                <a href="前端知识点.html">
            
                    
                    前端知识点
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="classic.html">
            
                <a href="classic.html">
            
                    
                    一代经典
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >前端知识点</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x524D;&#x8A00;">&#x524D;&#x8A00;</h1>
<p>&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x6574;&#x7406;&#x8FD9;&#x4EFD;&#x6587;&#x6863;&#xFF1F;</p>
<p>&#x62DB;&#x8058;&#x662F;&#x4E2A;&#x53CC;&#x5411;&#x9009;&#x62E9;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x4E00;&#x822C;&#x5019;&#x9009;&#x4EBA;&#x9009;&#x62E9;&#x516C;&#x53F8;&#x770B;&#x91CD;&#x516C;&#x53F8;&#x7684;&#x58F0;&#x671B;&#x3001;&#x6240;&#x5E94;&#x8058;&#x5C97;&#x4F4D;&#x5DE5;&#x4F5C;&#x5185;&#x5BB9;&#x548C;&#x53D1;&#x5C55;&#x7A7A;&#x95F4;&#x3001;&#x56E2;&#x961F;&#x6C1B;&#x56F4;&#x548C;&#x85AA;&#x8D44;&#x5F85;&#x9047;&#x7B49;&#xFF0C;&#x8FD9;&#x4E9B;&#x76F8;&#x5BF9;&#x6BD4;&#x8F83;&#x5BB9;&#x6613;&#x5224;&#x65AD;</p>
<p>&#x4F46;&#x662F;&#x516C;&#x53F8;&#x5BF9;&#x5019;&#x9009;&#x4EBA;&#x4E0E;&#x62DB;&#x8058;&#x5C97;&#x4F4D;&#x7684;&#x5339;&#x914D;&#x7A0B;&#x5EA6;&#x6BD4;&#x8F83;&#x96BE;&#x5224;&#x65AD;&#xFF0C;&#x6240;&#x4EE5;&#x9700;&#x8981;&#x5927;&#x91CF;&#x7684;&#x9762;&#x8BD5;&#x6C9F;&#x901A;</p>
<p>&#x4E3A;&#x4E86;&#x63D0;&#x9AD8;&#x62DB;&#x8058;&#x6548;&#x7387;&#xFF0C;&#x51CF;&#x5C11;&#x6C9F;&#x901A;&#xFF0C;&#x4E5F;&#x8282;&#x7701;&#x5019;&#x9009;&#x4EBA;&#x81EA;&#x8EAB;&#x5E94;&#x8058;&#x65F6;&#x95F4;&#xFF0C;&#x5E2E;&#x52A9;&#x5019;&#x9009;&#x4EBA;&#x4E3B;&#x52A8;&#x5224;&#x65AD;&#x81EA;&#x8EAB;&#x638C;&#x63E1;&#x7684;&#x4E13;&#x4E1A;&#x6280;&#x80FD;&#x548C;&#x62DB;&#x8058;&#x5C97;&#x4F4D;&#x4E4B;&#x95F4;&#x7684;&#x5339;&#x914D;&#x7A0B;&#x5EA6;&#xFF0C;&#x7279;&#x6574;&#x7406;&#x6B64;&#x6587;&#x6863;</p>
<p>&#x5E0C;&#x671B;&#x5BF9;&#x6280;&#x672F;&#x6709;&#x8FFD;&#x6C42;&#x3001;&#x6709;&#x6FC0;&#x60C5;&#xFF0C;&#x5BF9;&#x6240;&#x5E94;&#x8058;&#x5C97;&#x4F4D;&#x6BD4;&#x8F83;&#x91CD;&#x89C6;&#x7684;&#x4F60;&#x80FD;&#x591F;&#x8010;&#x5FC3;&#x7684;&#x9605;&#x8BFB;&#x5B8C;&#x6B64;&#x7BC7;&#x6587;&#x6863;&#xFF0C;&#x5E76;&#x8BA4;&#x771F;&#x5BA2;&#x89C2;&#x7684;&#x5206;&#x6790;&#x5F53;&#x524D;&#x72B6;&#x6001;&#x662F;&#x5426;&#x4E0E;&#x5E94;&#x8058;&#x5C97;&#x4F4D;&#x6BD4;&#x8F83;&#x5339;&#x914D;&#x4E86;&#xFF0C;&#x518D;&#x505A;&#x4E0B;&#x4E00;&#x6B65;&#x6253;&#x7B97;</p>
<p><strong>&#x9700;&#x8981;&#x8BF4;&#x660E;&#x7684;&#x662F;&#xFF0C;&#x62DB;&#x8058;&#x5339;&#x914D;&#x5EA6;&#x5224;&#x65AD;&#x672C;&#x8EAB;&#x662F;&#x4EF6;&#x5F88;&#x590D;&#x6742;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x76EE;&#x524D;&#x8FD8;&#x6CA1;&#x6709;&#x54EA;&#x4E2A;&#x4F53;&#x7CFB;&#x80FD;&#x767E;&#x5206;&#x767E;&#x771F;&#x5B9E;&#x51C6;&#x786E;&#x7684;&#x5224;&#x65AD;&#x65E0;&#x8BEF;&#xFF0C;&#x672C;&#x7BC7;&#x6587;&#x6863;&#x53EA;&#x662F;&#x4F5C;&#x4E3A;&#x53C2;&#x8003;&#xFF0C;&#x5176;&#x4E2D;&#x5217;&#x4E3E;&#x7684;&#x77E5;&#x8BC6;&#x70B9;&#x548C;&#x76F8;&#x5173;&#x6587;&#x6863;&#x4E5F;&#x4EC5;&#x4F5C;&#x4E3A;&#x53C2;&#x8003;</strong></p>
<p>&#x4E0B;&#x9762;&#x5F00;&#x59CB;&#x5217;&#x4E3E;&#x6211;&#x4EEC;&#x6BD4;&#x8F83;&#x5728;&#x610F;&#x7684;&#x77E5;&#x8BC6;&#x70B9;&#x548C;&#x76F8;&#x5173;&#x95EE;&#x9898;&#x4E3E;&#x4F8B;</p>
<h1 id="js&#xFF08;&#x7279;&#x522B;&#x91CD;&#x8981;&#xFF09;">js&#xFF08;&#x7279;&#x522B;&#x91CD;&#x8981;&#xFF09;</h1>
<h2 id="es6">es6</h2>
<h3 id="&#x8003;&#x5BDF;&#x610F;&#x4E49;">&#x8003;&#x5BDF;&#x610F;&#x4E49;</h3>
<p>&#x73B0;&#x5728;es6&#x4EE5;&#x53CA;es7&#x7B49;&#x65B0;&#x7684;js&#x8BED;&#x6CD5;&#x5DF2;&#x7ECF;&#x5E7F;&#x6CDB;&#x5E94;&#x7528;&#x5728;&#x9879;&#x76EE;&#x4E2D;&#x4E86;&#xFF0C;&#x8BE2;&#x95EE;es6&#x7684;&#x76F8;&#x5173;&#x77E5;&#x8BC6;&#x70B9;&#x4E00;&#x65B9;&#x9762;&#x89C2;&#x5BDF;&#x5BF9;es6&#x7684;&#x719F;&#x7EC3;&#x7A0B;&#x5EA6;&#xFF0C;&#x719F;&#x7EC3;&#x7A0B;&#x5EA6;&#x8F83;&#x5DEE;&#x7684;&#x5F71;&#x54CD;&#x9879;&#x76EE;&#x5F00;&#x53D1;&#xFF0C;&#x4E5F;&#x4FA7;&#x9762;&#x53CD;&#x6620;&#x51FA;&#x5BF9;&#x65B0;&#x6280;&#x672F;&#x7684;&#x5B66;&#x4E60;&#x8FFD;&#x6C42;&#x8F83;&#x5DEE;</p>
<p>es6&#x9664;&#x4E86;&#x5E38;&#x89C1;&#x6280;&#x80FD;&#x4F7F;&#x7528;&#x719F;&#x7EC3;&#x5916;&#xFF0C;&#x80CC;&#x540E;&#x7684;&#x77E5;&#x8BC6;&#x70B9;&#x7EC6;&#x8282;&#x4E5F;&#x8981;&#x5168;&#x9762;&#x638C;&#x63E1;&#xFF0C;&#x5C3D;&#x91CF;&#x4E0D;&#x80FD;&#x843D;&#xFF0C;&#x5426;&#x5219;&#x7ED9;&#x4EBA;&#x611F;&#x89C9;&#x6C34;&#x5E73;&#x4E00;&#x822C;&#xFF0C;&#x5F71;&#x54CD;&#x8BC4;&#x4EF7;&#xFF0C;&#x6BD4;&#x5982;&#x95EE;&#x7BAD;&#x5934;&#x51FD;&#x6570;&#x548C;&#x666E;&#x901A;&#x51FD;&#x6570;&#x533A;&#x522B;&#xFF0C;&#x5982;&#x679C;&#x77E5;&#x9053;this&#x7684;&#x533A;&#x522B;&#xFF0C;&#x8BF4;&#x660E;&#x591F;&#x7528;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x53EA;&#x77E5;&#x9053;this&#x533A;&#x522B;&#x7ED9;&#x4EBA;&#x611F;&#x89C9;&#x77E5;&#x8BC6;&#x9762;&#x8F83;&#x7A84;&#xFF0C;&#x4E0D;&#x7B97;&#x5F88;&#x7A81;&#x51FA;</p>
<p>&#x5EFA;&#x8BAE;es6&#x76F8;&#x5173;&#x77E5;&#x8BC6;&#x7CFB;&#x7EDF;&#x6027;&#x7684;&#x5B66;&#x4E60;&#x4E0B;&#xFF0C;&#x4E0D;&#x8981;&#x9879;&#x76EE;&#x4E2D;&#x7528;&#x5230;&#x4EC0;&#x4E48;&#x67E5;&#x4E0B;&#x6587;&#x6863;&#x770B;&#x4E0B;&#x611F;&#x89C9;&#x5C31;OK&#x4E86;&#xFF0C;&#x4E66;&#x7C4D;&#x65B9;&#x9762;&#x53EF;&#x4EE5;&#x628A;&#x962E;&#x4E00;&#x5CF0;&#x5199;&#x7684;ES6&#x6807;&#x51C6;&#x5165;&#x95E8;&#xFF08;&#x7B2C;3&#x7248;&#xFF09;&#x770B;&#x4E0B;&#xFF0C;&#x5199;&#x7684;&#x5F88;&#x4E0D;&#x9519;&#xFF0C;&#x5F88;&#x5168;&#x9762;&#xFF0C;&#x7EC6;&#x8282;&#x57FA;&#x672C;&#x90FD;&#x8BB2;&#x5230;&#x4E86;&#xFF0C;&#x4E66;&#x4E2D;&#x5199;&#x7684;&#x77E5;&#x8BC6;&#x70B9;&#x5982;&#x679C;&#x5168;&#x90E8;&#x638C;&#x63E1;&#xFF0C;es6&#x8FD9;&#x5757;&#x5E94;&#x8BE5;&#x5DEE;&#x4E0D;&#x591A;&#x4E86;</p>
<h3 id="&#x5E38;&#x89C1;&#x77E5;&#x8BC6;&#x70B9;">&#x5E38;&#x89C1;&#x77E5;&#x8BC6;&#x70B9;</h3>
<ul>
<li>let/const/var&#x533A;&#x522B;&#xFF08;&#x975E;&#x5E38;&#x91CD;&#x8981;&#xFF09;&#xFF0C;&#x5173;&#x4E8E;let/const&#x7684;&#x6240;&#x6709;&#x77E5;&#x8BC6;&#x70B9;&#x5168;&#x90E8;&#x638C;&#x63E1;&#xFF0C;&#x6700;&#x597D;&#x4E00;&#x4E2A;&#x4E0D;&#x843D;</li>
<li>&#x7BAD;&#x5934;&#x51FD;&#x6570;&#x3001;&#x666E;&#x901A;&#x51FD;&#x6570;&#x533A;&#x522B;&#xFF08;&#x975E;&#x5E38;&#x91CD;&#x8981;&#xFF09;&#xFF0C;&#x5FC5;&#x987B;&#x7406;&#x89E3;&#x7BAD;&#x5934;&#x51FD;&#x6570;&#x7684;this&#x672C;&#x8D28;&#xFF0C;&#x4E00;&#x70B9;&#x4E0D;&#x80FD;&#x542B;&#x7CCA;&#xFF0C;this&#x7684;&#x8003;&#x5BDF;&#x65B9;&#x5F0F;&#x5F88;&#x591A;&#xFF0C;&#x53EA;&#x8981;&#x8BA9;&#x4EBA;&#x611F;&#x89C9;this&#x638C;&#x63E1;&#x4E0D;&#x6E05;&#x6670;&#xFF0C;es6&#x8FD9;&#x5757;&#x7684;&#x8BC4;&#x4EF7;&#x5C31;&#x4E0D;&#x4F1A;&#x9AD8;&#xFF0C;&#x9664;&#x6B64;&#x4E4B;&#x5916;&#xFF0C;&#x7BAD;&#x5934;&#x51FD;&#x6570;&#x8FD8;&#x6709;&#x5176;&#x5B83;&#x533A;&#x522B;&#x548C;&#x666E;&#x901A;&#x51FD;&#x6570;&#xFF0C;&#x591A;&#x4E86;&#x89E3;</li>
<li>promise/async&amp;await/&#x751F;&#x6210;&#x5668;&#x51FD;&#x6570;&#xFF08;&#x975E;&#x5E38;&#x91CD;&#x8981;&#xFF09;&#xFF0C;&#x751F;&#x6210;&#x5668;&#x51FD;&#x6570;&#x6700;&#x597D;&#x4E86;&#x89E3;&#x4E0B;&#xFF0C;&#x8981;&#x662F;&#x95EE;&#x9053;&#x5565;&#x4E5F;&#x4E0D;&#x77E5;&#x9053;&#xFF0C;&#x5F71;&#x54CD;&#x8BC4;&#x4EF7;&#xFF0C;promise&#x7684;&#x6807;&#x51C6;&#x6709;&#x597D;&#x51E0;&#x5957;&#xFF0C;&#x5BB9;&#x6613;&#x5F04;&#x6DF7;&#xFF0C;&#x5EFA;&#x8BAE;&#x628A;es6&#x4E2D;&#x7684;promise&#x6807;&#x51C6;&#x597D;&#x597D;&#x770B;&#x770B;&#xFF0C;&#x8FD9;&#x91CC;&#x9762;&#x7EC6;&#x8282;&#x7279;&#x522B;&#x591A;&#xFF0C;1&#x4E2A;&#x90FD;&#x4E0D;&#x80FD;&#x62C9;&#xFF0C;&#x5EFA;&#x8BAE;&#x5148;&#x7CFB;&#x7EDF;&#x5B66;&#x4E60;&#x4E0B;promise&#xFF0C;&#x7136;&#x540E;&#x627E;&#x4E9B;promise&#x9898;&#x76EE;&#xFF0C;&#x770B;&#x770B;&#x81EA;&#x5DF1;&#x662F;&#x4E0D;&#x662F;&#x6709;&#x6B20;&#x7F3A;&#xFF1B;&#x5982;&#x679C;&#x53EF;&#x4EE5;&#xFF0C;&#x5EFA;&#x8BAE;&#x628A;promise&#x7684;&#x5B9E;&#x73B0;&#x4E5F;&#x4E86;&#x89E3;&#x4E0B;&#xFF0C;&#x5C5E;&#x4E8E;&#x52A0;&#x5206;&#x9879;&#xFF0C;&#x8FD9;&#x91CC;&#x7684;promise&#x5B9E;&#x73B0;&#xFF0C;&#x6307;&#x81EA;&#x5DF1;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;Promise&#x7C7B;&#x7ED9;&#x522B;&#x4EBA;&#x7528;&#xFF0C;api&#x548C;es6&#x6807;&#x51C6;&#x4FDD;&#x6301;&#x5B8C;&#x5168;&#x4E00;&#x81F4;&#xFF1B;&#x6700;&#x540E;promise&#x548C;es7&#x4E2D;&#x7684;async&amp;await&#x53EF;&#x4EE5;&#x7ED3;&#x5408;&#x4F7F;&#x7528;&#xFF0C;&#x8FD9;&#x5757;&#x5EFA;&#x8BAE;&#x6DF1;&#x6316;&#x4E00;&#x4E0B;</li>
<li>class&#xFF08;&#x4E00;&#x822C;&#x91CD;&#x8981;&#xFF09;&#xFF0C;&#x4E3B;&#x8981;&#x662F;es6&#x5982;&#x4F55;&#x5B9A;&#x4E49;&#x7C7B;&#xFF0C;&#x8FD9;&#x5757;&#x53EA;&#x8981;&#x77E5;&#x9053;&#x5C31;&#x884C;&#xFF0C;&#x6700;&#x597D;&#x662F;&#x628A;es6&#x4E2D;&#x7684;class&#x548C;es5&#x4E2D;&#x7C7B;&#x7684;&#x5B9A;&#x4E49;&#x505A;&#x4E0B;&#x6BD4;&#x8F83;&#xFF0C;&#x4E4B;&#x95F4;&#x7684;&#x5DEE;&#x5F02;&#x5982;&#x679C;&#x5B8C;&#x5168;&#x7406;&#x89E3;&#x638C;&#x63E1;&#x6700;&#x597D;&#xFF0C;&#x5426;&#x5219;&#x4E5F;&#x5BB9;&#x6613;&#x5F71;&#x54CD;&#x8BC4;&#x4EF7;&#xFF1B;&#x7C7B;&#x548C;&#x7EE7;&#x627F;&#x8FD9;&#x5757;&#x5BB9;&#x6613;&#x7275;&#x626F;&#x51FA;js&#x7684;&#x6838;&#x5FC3;&#x77E5;&#x8BC6;&#x70B9;&#x539F;&#x578B;&#x3001;&#x539F;&#x578B;&#x94FE;&#x3001;&#x7EE7;&#x627F;&#xFF0C;&#x8FD8;&#x662F;&#x5F88;&#x91CD;&#x8981;&#x7684;&#xFF0C;&#x867D;&#x7136;class&#x672C;&#x8EAB;&#x53EA;&#x77E5;&#x9053;&#x7528;&#x5C31;&#x884C;&#x4E86;&#xFF0C;&#x4F46;&#x5BB9;&#x6613;&#x56E0;&#x4E3A;&#x4E00;&#x4E2A;class&#x95EE;&#x9898;&#x66B4;&#x9732;&#x539F;&#x578B;&#x3001;&#x539F;&#x578B;&#x94FE;&#x3001;&#x7EE7;&#x627F;&#x8FD9;&#x4E2A;&#x6838;&#x5FC3;&#x77E5;&#x8BC6;&#x70B9;&#x7684;&#x8F6F;&#x808B;&#xFF0C;&#x6240;&#x4EE5;&#x8FD8;&#x662F;&#x8981;&#x91CD;&#x89C6;&#xFF0C;&#x4E00;&#x5B9A;&#x8981;&#x638C;&#x63E1;es6 class&#x7684;&#x672C;&#x8D28;</li>
<li>&#x6A21;&#x5757;&#xFF08;&#x975E;&#x5E38;&#x91CD;&#x8981;&#xFF09;&#xFF0C;es6&#x7684;&#x6A21;&#x5757;&#x6807;&#x51C6;&#x8981;&#x5168;&#x90E8;&#x638C;&#x63E1;&#xFF0C;&#x5C3D;&#x91CF;&#x6240;&#x6709;&#x7EC6;&#x8282;&#x90FD;&#x4E0D;&#x843D;&#xFF0C;&#x8FD9;&#x5757;&#x5BB9;&#x6613;&#x5F15;&#x5BFC;&#x51FA;&#x65B0;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6BD4;&#x5982;es6&#x6A21;&#x5757;&#x548C;nodejs&#x4E2D;&#x4F7F;&#x7528;&#x7684;commonjs&#x6A21;&#x5757;&#x89C4;&#x8303;&#x7684;&#x5DEE;&#x5F02;&#x5BF9;&#x6BD4;&#x7B49;&#x7B49;&#xFF0C;&#x751A;&#x81F3;&#x95EE;&#x5230;AMD/CMD&#x8FD9;&#x51E0;&#x79CD;&#x6A21;&#x5757;&#x89C4;&#x8303;&#x7684;&#x5404;&#x79CD;&#x7EC6;&#x8282;&#xFF0C;&#x6700;&#x597D;&#x628A;es6&#x6A21;&#x5757;/commonjs/amd/cmd&#x8FD9;&#x51E0;&#x79CD;&#x6A21;&#x5757;&#x89C4;&#x8303;&#x5404;&#x79CD;&#x7EC6;&#x8282;&#x90FD;&#x5168;&#x9762;&#x638C;&#x63E1;&#xFF0C;&#x7136;&#x540E;&#x4E92;&#x76F8;&#x5BF9;&#x6BD4;&#x5DEE;&#x5F02;</li>
<li>&#x5B57;&#x7B26;&#x4E32;&#x3001;&#x6570;&#x7EC4;&#x3001;&#x51FD;&#x6570;&#x3001;&#x5BF9;&#x8C61;&#x62D3;&#x5C55;&#xFF08;&#x4E00;&#x822C;&#x91CD;&#x8981;&#xFF09;&#xFF0C;&#x8FD9;&#x5757;&#x7EC6;&#x8282;&#x6BD4;&#x8F83;&#x591A;&#xFF0C;&#x6BD4;&#x8F83;&#x96F6;&#x788E;&#xFF0C;&#x6CA1;&#x6709;&#x6240;&#x8C13;&#x7684;&#x91CD;&#x70B9;&#xFF0C;&#x591A;&#x79EF;&#x7D2F;&#x5427;&#xFF0C;&#x5982;&#x679C;&#x79EF;&#x7D2F;&#x5C11;&#xFF0C;&#x4F1A;&#x7ED9;&#x4EBA;&#x611F;&#x89C9;es6&#x7ECF;&#x9A8C;&#x8F83;&#x6D45;&#xFF0C;&#x4E0D;&#x591F;&#x4E30;&#x5BCC;&#xFF0C;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x8D1F;&#x9762;&#x5F71;&#x54CD;</li>
<li>Symbol&#x3001;Set&#x3001;Map&#xFF08;&#x4E00;&#x822C;&#x91CD;&#x8981;&#xFF09;&#xFF0C;&#x8FD9;&#x5757;&#x539F;&#x7406;&#x6027;&#x4E1C;&#x897F;&#x4E0D;&#x591A;&#xFF0C;&#x719F;&#x6089;&#x5C31;&#x597D;</li>
<li>Proxy&#xFF08;&#x6BD4;&#x8F83;&#x91CD;&#x8981;&#xFF09;&#xFF0C;es6&#x7684;&#x4EE3;&#x7406;&#x6709;&#x65B0;&#x7684;&#x4F5C;&#x7528;&#xFF0C;&#x5EFA;&#x8BAE;&#x597D;&#x597D;&#x719F;&#x6089;&#x4E0B;&#x5176;&#x529F;&#x80FD;&#x548C;&#x7528;&#x6CD5;&#xFF0C;&#x592A;&#x7EC6;&#x8282;&#x7684;&#x53EF;&#x4EE5;&#x4E0D;&#x638C;&#x63E1;</li>
<li>&#x88C5;&#x9970;&#x5668;&#xFF08;&#x4E00;&#x822C;&#x91CD;&#x8981;&#xFF09;&#xFF0C;&#x4E86;&#x89E3;&#x4E0B;&#x529F;&#x80FD;&#x548C;&#x7528;&#x6CD5;</li>
</ul>
<h2 id="es5">es5</h2>
<p>es5&#x7684;&#x77E5;&#x8BC6;&#x70B9;&#x73B0;&#x5728;&#x7528;&#x7684;&#x4E0D;&#x591A;&#x4E86;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x5199;&#x6846;&#x67B6;&#x3001;&#x5DE5;&#x5177;&#x5E93;&#x4EC0;&#x4E48;&#x7684;&#x8FD8;&#x662F;&#x4F1A;&#x7528;&#x5230;&#x7684;&#xFF0C;&#x4E3A;&#x4E86;&#x50A8;&#x5907;&#x4EBA;&#x624D;&#xFF0C;es5&#x4E5F;&#x8981;&#x6C42;&#x975E;&#x5E38;&#x719F;&#x7EC3;&#xFF0C;es5&#x7684;&#x719F;&#x7EC3;&#x7A0B;&#x5EA6;&#x4EE3;&#x8868;&#x4E86;&#x8FD9;&#x4E2A;&#x4EBA;js&#x7684;&#x57FA;&#x7840;&#x624E;&#x5B9E;&#x7A0B;&#x5EA6;</p>
<p>es5&#x65B9;&#x9762;&#x4E00;&#x822C;&#x6BD4;&#x8F83;&#x559C;&#x6B22;&#x95EE;&#x7C7B;&#x7684;&#x5B9A;&#x4E49;&#x3001;&#x7EE7;&#x627F;&#x3001;&#x539F;&#x578B;&#x3001;&#x539F;&#x578B;&#x94FE;&#x3001;&#x95ED;&#x5305;</p>
<p>&#x5173;&#x4E8E;&#x7C7B;&#x7684;&#x5B9A;&#x4E49;&#x3001;&#x5355;&#x7EE7;&#x627F;&#x3001;&#x591A;&#x7EE7;&#x627F;&#x4E00;&#x822C;&#x662F;&#x7EC4;&#x5408;&#x95EE;&#x7B54;&#xFF0C;&#x5176;&#x4E2D;&#x5C31;&#x4F1A;&#x7275;&#x626F;&#x5230;&#x539F;&#x578B;&#x3001;&#x539F;&#x578B;&#x94FE;&#x77E5;&#x8BC6;&#xFF0C;&#x5EFA;&#x8BAE;&#x5BF9;&#x539F;&#x578B;&#x3001;&#x539F;&#x578B;&#x94FE;&#x7EE7;&#x627F;&#x8FD9;&#x5757;&#x4E0D;&#x662F;&#x5F88;&#x6E05;&#x695A;&#x7684;&#x4E00;&#x5B9A;&#x8981;&#x7CFB;&#x7EDF;&#x6027;&#x5B66;&#x4E60;&#x4E0B;&#xFF0C;&#x628A;&#x8FD9;&#x5757;&#x7684;&#x539F;&#x7406;&#x548C;&#x5404;&#x79CD;&#x7EC6;&#x8282;&#x5168;&#x90E8;&#x641E;&#x6E05;&#x695A;&#xFF0C;&#x4E00;&#x70B9;&#x90FD;&#x4E0D;&#x80FD;&#x542B;&#x7CCA;&#xFF0C;&#x5426;&#x5219;&#x4F1A;&#x88AB;&#x8BA4;&#x4E3A;js&#x57FA;&#x7840;&#x4E0D;&#x624E;&#x5B9E;</p>
<h1 id="css&#xFF08;&#x4E00;&#x822C;&#x91CD;&#x8981;&#xFF09;">css&#xFF08;&#x4E00;&#x822C;&#x91CD;&#x8981;&#xFF09;</h1>
<p>&#x73B0;&#x5728;js&#x7684;&#x5F71;&#x54CD;&#x592A;&#x5927;&#x4E86;&#xFF0C;&#x5F88;&#x591A;&#x6846;&#x67B6;&#x90FD;&#x662F;js&#x5199;&#x7684;&#xFF0C;&#x52A0;&#x4E0A;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x8D8A;&#x6765;&#x8D8A;&#x590D;&#x6742;&#xFF0C;&#x5927;&#x91CF;&#x7684;&#x5DE5;&#x4F5C;&#x90FD;&#x9700;&#x8981;js&#x6765;&#x5B8C;&#x6210;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x662F;&#x505A;&#x8FD0;&#x8425;&#x6D3B;&#x52A8;&#x52A8;&#x753B;&#x76F8;&#x5173;&#xFF0C;css&#x5F71;&#x54CD;&#x6BD4;&#x8F83;&#x5C0F;&#xFF0C;&#x8981;&#x6C42;&#x4E5F;&#x4E0D;&#x662F;&#x7279;&#x522B;&#x9AD8;&#x4E86;</p>
<p>css&#x8FD9;&#x5757;&#x7684;&#x638C;&#x63E1;&#x7A0B;&#x5EA6;&#x5C3D;&#x91CF;&#x505A;&#x5230;&#x57FA;&#x7840;&#x624E;&#x5B9E;&#xFF0C;&#x5E38;&#x89C1;&#x77E5;&#x8BC6;&#x70B9;&#x80FD;&#x719F;&#x7EC3;&#x5E94;&#x7528;&#x5C31;&#x5DEE;&#x4E0D;&#x591A;&#x4E86;</p>
<h2 id="&#x5E38;&#x89C1;&#x77E5;&#x8BC6;&#x70B9;">&#x5E38;&#x89C1;&#x77E5;&#x8BC6;&#x70B9;</h2>
<ul>
<li>&#x76D2;&#x6A21;&#x578B;&#xFF0C;&#x6709;&#x4E0D;&#x6E05;&#x695A;&#x7684;&#x4E00;&#x5B9A;&#x8981;&#x641E;&#x6E05;&#x695A;</li>
<li>position&#x53D6;&#x503C;&#x3001;&#x533A;&#x522B;&#xFF0C;&#x5168;&#x90E8;&#x641E;&#x6E05;&#x695A;&#xFF0C;&#x5BF9;absolute&#x53C2;&#x8003;&#x8C01;&#x53BB;&#x5B9A;&#x4F4D;&#x597D;&#x597D;&#x5B66;&#x5B66;</li>
<li>flex&#x5E03;&#x5C40;&#xFF0C;&#x80FD;&#x719F;&#x7EC3;&#x5E94;&#x7528;&#x5C31;&#x884C;&#x4E86;</li>
<li>&#x79FB;&#x52A8;&#x7AEF;&#x9875;&#x9762;&#x9002;&#x914D;&#x65B9;&#x6848;&#xFF0C;&#x591A;&#x4E86;&#x89E3;&#x51E0;&#x79CD;&#x65B9;&#x6848;&#xFF0C;&#x6BCF;&#x79CD;&#x65B9;&#x6848;&#x8981;&#x5B8C;&#x5168;&#x4E86;&#x89E3;&#xFF0C;&#x4E0D;&#x80FD;&#x7ED9;&#x4EBA;&#x611F;&#x89C9;&#x77E5;&#x9053;&#x4E00;&#x70B9;&#xFF0C;&#x4F46;&#x4E0D;&#x5168;&#x9762;&#xFF0C;&#x5B9E;&#x8DF5;&#x4F1A;&#x6709;&#x95EE;&#x9898;&#x7684;&#x8D1F;&#x9762;&#x5370;&#x8C61;&#xFF0C;&#x8FD9;&#x5757;&#x5BB9;&#x6613;&#x95EE;rem&#x539F;&#x7406;&#xFF0C;rem&#x539F;&#x7406;&#x8981;&#x5B8C;&#x5168;&#x641E;&#x6E05;&#x695A;</li>
<li>&#x5176;&#x5B83;css&#x77E5;&#x8BC6;&#x70B9;&#xFF0C;css&#x7EC6;&#x8282;&#x6BD4;&#x8F83;&#x591A;&#xFF0C;&#x5C5E;&#x4E8E;&#x6162;&#x6162;&#x79EF;&#x7D2F;&#x8FC7;&#x7A0B;&#xFF0C;&#x6CA1;&#x6CD5;&#x77ED;&#x671F;&#x901F;&#x6210;&#x5168;&#x9762;&#x638C;&#x63E1;<h1 id="&#x6846;&#x67B6;&#xFF08;&#x7279;&#x522B;&#x91CD;&#x8981;&#xFF09;">&#x6846;&#x67B6;&#xFF08;&#x7279;&#x522B;&#x91CD;&#x8981;&#xFF09;</h1>
</li>
</ul>
<h2 id="&#x8003;&#x5BDF;&#x610F;&#x4E49;">&#x8003;&#x5BDF;&#x610F;&#x4E49;</h2>
<p>&#x56E0;&#x4E3A;js&#x975E;&#x5E38;&#x91CD;&#x8981;&#xFF0C;&#x6240;&#x4EE5;&#x7528;js&#x5199;&#x7684;&#x6846;&#x67B6;&#x4E5F;&#x975E;&#x5E38;&#x91CD;&#x8981;&#xFF0C;&#x5E38;&#x89C1;&#x7684;&#x6846;&#x67B6;&#x6709;react/vue/angular&#xFF0C;&#x56E0;&#x4E3A;&#x56FD;&#x5185;angular&#x7528;&#x5F97;&#x5C11;&#xFF0C;&#x5EFA;&#x8BAE;react/vue&#x7CBE;&#x901A;&#x4E00;&#x95E8;&#xFF0C;react/vue&#x5EFA;&#x8BAE;&#x7CBE;&#x901A;react&#xFF0C;&#x5BF9;&#x4E8E;2&#x79CD;&#x6846;&#x67B6;&#x90FD;&#x6BD4;&#x8F83;&#x719F;&#x6089;&#x4F46;&#x90FD;&#x4E0D;&#x662F;&#x7279;&#x522B;&#x7CBE;&#x901A;&#x548C;&#x7CBE;&#x901A;&#x5176;&#x4E2D;&#x4E00;&#x79CD;&#xFF0C;&#x6211;&#x4EEC;&#x66F4;&#x503E;&#x5411;&#x4E8E;&#x7CBE;&#x901A;&#x5176;&#x4E2D;&#x4E00;&#x79CD;&#x7684;&#x4EBA;</p>
<p>&#x6846;&#x67B6;&#x5728;&#x4F7F;&#x7528;&#x5C42;&#x9762;&#x4E00;&#x5B9A;&#x8981;&#x975E;&#x5E38;&#x719F;&#x7EC3;&#xFF0C;&#x719F;&#x7EC3;&#x7684;&#x57FA;&#x7840;&#x662F;&#x4F7F;&#x7528;&#x6846;&#x67B6;&#x505A;&#x8FC7;&#x5F88;&#x591A;&#x4E1A;&#x52A1;&#xFF0C;&#x540C;&#x65F6;&#x5BF9;&#x4E8E;&#x6846;&#x67B6;&#x7684;&#x4F7F;&#x7528;&#x7EC6;&#x8282;&#x8FDB;&#x884C;&#x8FC7;&#x94BB;&#x7814;</p>
<p>&#x53EA;&#x662F;&#x719F;&#x7EC3;&#x5E94;&#x7528;&#x4F30;&#x8BA1;&#x4E5F;&#x4E0D;&#x884C;&#xFF0C;&#x56E0;&#x4E3A;&#x6846;&#x67B6;&#x662F;js&#x5199;&#x7684;&#xFF0C;&#x8FD9;&#x5757;&#x6709;&#x5F88;&#x591A;&#x539F;&#x7406;&#x6027;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4E5F;&#x662F;&#x6C34;&#x5E73;&#x5206;&#x7EA7;&#x7684;&#x9886;&#x57DF;&#xFF0C;&#x5EFA;&#x8BAE;&#x628A;&#x6240;&#x7CBE;&#x901A;&#x7684;&#x6846;&#x67B6;&#x7684;&#x5B9E;&#x73B0;&#x539F;&#x7406;&#x597D;&#x597D;&#x641E;&#x6E05;&#x695A;&#xFF0C;&#x4E0D;&#x7BA1;&#x662F;&#x770B;&#x6587;&#x7AE0;&#x8FD8;&#x662F;&#x770B;&#x6E90;&#x7801;&#xFF0C;&#x7ED3;&#x679C;&#x5C31;&#x662F;&#x539F;&#x7406;&#x5F88;&#x6E05;&#x695A;&#xFF0C;&#x5426;&#x5219;&#x5F71;&#x54CD;&#x6846;&#x67B6;&#x8FD9;&#x5757;&#x7684;&#x8BC4;&#x4EF7;&#xFF0C;&#x6846;&#x67B6;&#x7684;&#x539F;&#x7406;&#x5982;&#x679C;&#x641E;&#x6E05;&#x695A;&#x4E86;&#xFF0C;&#x7EDD;&#x5BF9;&#x662F;&#x4E2A;&#x4EBA;&#x52A0;&#x5206;&#x9879;</p>
<p>react/vue&#x8FD9;2&#x79CD;&#x6846;&#x67B6;&#x6709;&#x5DEE;&#x5F02;&#xFF0C;&#x4F46;&#x6838;&#x5FC3;&#x539F;&#x7406;&#x57FA;&#x672C;&#x662F;&#x76F8;&#x4F3C;&#x7684;&#xFF0C;&#x5EFA;&#x8BAE;&#x5728;&#x539F;&#x7406;&#x65B9;&#x9762;&#x91CD;&#x70B9;&#x638C;&#x63E1;&#x5982;&#x4E0B;</p>
<ul>
<li>jsx&#x8BED;&#x6CD5;&#x672C;&#x8D28;</li>
<li>jsx&#x5982;&#x4F55;&#x521B;&#x5EFA;&#x51FA;&#x865A;&#x62DF;DOM&#x6811;</li>
<li>&#x66F4;&#x65B0;&#x8FC7;&#x7A0B;2&#x8BFE;&#x865A;&#x62DF;DOM&#x6811;&#x5982;&#x4F55;diff&#x627E;&#x5230;patch&#xFF08;&#x6700;&#x5C0F;&#x5DEE;&#x5F02;&#xFF09;</li>
</ul>
<p>&#x53E6;&#x5916;react/vue&#x8FD9;&#x79CD;&#x524D;&#x7AEF;&#x6846;&#x67B6;&#x57FA;&#x672C;&#x5728;&#x5355;&#x9875;&#x9762;&#x5E94;&#x7528;&#x642D;&#x914D;&#x8DEF;&#x7531;&#x4F7F;&#x7528;&#xFF0C;&#x8DEF;&#x7531;&#x7684;&#x8981;&#x6C42;&#x540C;&#x6846;&#x67B6;&#x4E00;&#x6837;&#xFF0C;&#x4F7F;&#x7528;&#x719F;&#x7EC3;&#xFF0C;&#x80CC;&#x540E;&#x539F;&#x7406;&#x5FC5;&#x987B;&#x638C;&#x63E1;</p>
<h2 id="react">react</h2>
<ul>
<li>&#x7EC4;&#x4EF6;&#x5B8C;&#x6574;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#x8FC7;&#x7A0B;&#xFF0C;&#x4ECE;&#x521D;&#x6B21;&#x521B;&#x5EFA;&#x5230;&#x66F4;&#x65B0;&#x5230;&#x9500;&#x6BC1;&#xFF08;react 16.x&#x4E4B;&#x540E;&#x6709;&#x6539;&#x52A8;&#xFF0C;16.x&#x4E4B;&#x524D;&#x7684;&#x8981;&#x7279;&#x522B;&#x719F;&#x6089;&#xFF0C;16.x&#x5C5E;&#x4E8E;&#x52A0;&#x5206;&#x9879;&#xFF09;</li>
<li>Component/PureComponent&#x533A;&#x522B;&#xFF0C;&#x8FD9;&#x5757;&#x5BB9;&#x6613;&#x7275;&#x626F;&#x51FA;react&#x7EC4;&#x4EF6;&#x5982;&#x4F55;&#x505A;&#x66F4;&#x65B0;&#x6027;&#x80FD;&#x4F18;&#x5316;&#xFF0C;&#x7EC6;&#x8282;&#x539F;&#x7406;&#x6BD4;&#x8F83;&#x591A;&#xFF0C;&#x4E0D;&#x719F;&#x6089;&#x7684;&#x5EFA;&#x8BAE;&#x597D;&#x597D;&#x770B;&#x4E0B;&#xFF0C;&#x4E0D;&#x80FD;&#x6709;&#x542B;&#x7CCA;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x5426;&#x5219;&#x7279;&#x522B;&#x5F71;&#x54CD;&#x5BF9;react&#x6846;&#x67B6;&#x7684;&#x638C;&#x63E1;&#x8BC4;&#x4EF7;</li>
<li>&#x5982;&#x4F55;&#x505A;&#x7EC4;&#x4EF6;&#x66F4;&#x65B0;&#x6027;&#x80FD;&#x4F18;&#x5316;&#xFF0C;&#x8FD9;&#x5757;&#x7EC6;&#x8282;&#x539F;&#x7406;&#x6BD4;&#x8F83;&#x591A;&#xFF0C;&#x5BB9;&#x6613;&#x95EE;&#x51FA;&#x5173;&#x8054;&#x7684;&#x5176;&#x5B83;&#x5DE5;&#x5177;&#x5E93;&#x548C;&#x77E5;&#x8BC6;&#x70B9;&#xFF0C;&#x5EFA;&#x8BAE;&#x6CA1;&#x6709;&#x4E30;&#x5BCC;&#x7EC4;&#x4EF6;&#x6027;&#x80FD;&#x4F18;&#x5316;&#x7ECF;&#x9A8C;&#x7684;&#x8FD9;&#x5757;&#x91CD;&#x70B9;&#x5B66;&#x4E60;&#x4E0B;&#xFF0C;&#x628A;&#x5404;&#x79CD;&#x4F18;&#x5316;&#x65B9;&#x6848;&#x3001;&#x7EC6;&#x8282;&#x3001;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x7684;&#x80CC;&#x540E;&#x539F;&#x7406;&#x3001;&#x5173;&#x8054;&#x7684;&#x5DE5;&#x5177;&#x5E93;&#x548C;&#x77E5;&#x8BC6;&#x70B9;&#x90FD;&#x91CD;&#x70B9;&#x638C;&#x63E1;</li>
</ul>
<h2 id="vue">vue</h2>
<ul>
<li>&#x53CC;&#x5411;&#x6570;&#x636E;&#x7ED1;&#x5B9A;&#x539F;&#x7406;&#xFF0C;&#x91CD;&#x70B9;&#x662F;&#x5982;&#x4F55;&#x505A;&#x6570;&#x636E;&#x52AB;&#x6301;&#xFF0C;&#x5373;&#x5982;&#x4F55;&#x77E5;&#x9053;&#x6570;&#x636E;&#x53D8;&#x5316;&#x4E86;&#xFF0C; vue 2.x&#x548C;3.x&#x5B9E;&#x73B0;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x90FD;&#x8981;&#x638C;&#x63E1;&#xFF0C;2.x&#x4F7F;&#x7528;&#x7684;&#x662F;get/set&#xFF0C;3.x&#x662F;proxy&#xFF0C;&#x4E8C;&#x8005;&#x7684;&#x5DEE;&#x5F02;&#x5BF9;&#x6BD4;&#xFF1B;&#x53E6;&#x5916;vue2.x&#x4E2D;&#x7684;&#x6570;&#x636E;&#x52AB;&#x6301;&#x54EA;&#x4E9B;&#x60C5;&#x51B5;&#x52AB;&#x6301;&#x4E0D;&#x5230;&#xFF0C;&#x76F8;&#x5E94;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x662F;&#x4EC0;&#x4E48;&#x90FD;&#x8981;&#x7406;&#x89E3;&#xFF0C;&#x6BD4;&#x5982;&#x7ED9;&#x5BF9;&#x8C61;&#x6DFB;&#x52A0;&#x65B0;&#x5C5E;&#x6027;&#x52AB;&#x6301;&#x4E0D;&#x5230;&#x5982;&#x4F55;&#x89E3;&#x51B3;&#xFF0C;&#x8C03;&#x7528;&#x6570;&#x7EC4;&#x7684;push&#x65B9;&#x6CD5;&#x4FEE;&#x6539;&#x6570;&#x636E;&#x52AB;&#x6301;&#x4E0D;&#x5230;&#x5982;&#x4F55;&#x89E3;&#x51B3;</li>
<li>&#x5176;&#x5B83;vue&#x6846;&#x67B6;&#x7684;&#x4F7F;&#x7528;&#x7EC6;&#x8282;&#xFF0C;&#x5C5E;&#x4E8E;&#x79EF;&#x7D2F;&#x8FC7;&#x7A0B;&#xFF0C;&#x719F;&#x7EC3;&#x4F7F;&#x7528;&#x6846;&#x67B6;&#x591A;&#x601D;&#x8003;&#x5E94;&#x8BE5;&#x6CA1;&#x95EE;&#x9898;</li>
</ul>
<h2 id="&#x8DEF;&#x7531;">&#x8DEF;&#x7531;</h2>
<p>react/vue&#x4F7F;&#x7528;&#x7684;&#x8DEF;&#x7531;&#x4F7F;&#x7528;&#x65B9;&#x5F0F;&#x5E94;&#x8BE5;&#x6709;&#x70B9;&#x5DEE;&#x5F02;&#xFF0C;&#x4F46;&#x5E95;&#x5C42;&#x90FD;&#x662F;js&#x5199;&#x7684;&#xFF0C;&#x539F;&#x7406;&#x57FA;&#x672C;&#x4E00;&#x6837;&#xFF0C;&#x91CD;&#x70B9;&#x638C;&#x63E1;&#x8DEF;&#x7531;&#x5B9E;&#x73B0;&#x539F;&#x7406;&#xFF0C;&#x8FD9;&#x5757;&#x5EFA;&#x8BAE;&#x7CFB;&#x7EDF;&#x6027;&#x5B66;&#x4E60;&#x4E0B;</p>
<h1 id="&#x7F16;&#x7A0B;&#xFF08;&#x6BD4;&#x8F83;&#x91CD;&#x8981;&#xFF09;">&#x7F16;&#x7A0B;&#xFF08;&#x6BD4;&#x8F83;&#x91CD;&#x8981;&#xFF09;</h1>
<p>&#x5982;&#x679C;&#x662F;css&#x6BD4;&#x8F83;&#x719F;&#x7EC3;&#xFF0C;js&#x5199;&#x7684;&#x4E0D;&#x591A;&#xFF0C;&#x90A3;&#x7F16;&#x7A0B;&#x8FD9;&#x5757;&#x4F30;&#x8BA1;&#x4F1A;&#x5F62;&#x6210;&#x8F6F;&#x808B;&#xFF0C;&#x7F16;&#x7A0B;&#x8FD9;&#x5757;&#x6CA1;&#x6CD5;&#x901F;&#x6210;&#xFF0C;&#x53EA;&#x80FD;&#x591A;&#x5199;&#x591A;&#x601D;&#x8003;</p>
<p>&#x5982;&#x679C;1&#x4E2A;&#x4EBA;js&#x57FA;&#x7840;&#x633A;&#x624E;&#x5B9E;&#xFF0C;&#x6846;&#x67B6;&#x4F7F;&#x7528;&#x719F;&#x7EC3;&#xFF0C;&#x539F;&#x7406;&#x4E5F;&#x7279;&#x522B;&#x6E05;&#x695A;&#xFF0C;&#x7F16;&#x7A0B;&#x4E0D;&#x624E;&#x5B9E;&#x4F1A;&#x7ED9;&#x4EBA;&#x5F88;&#x5947;&#x602A;&#x7684;&#x611F;&#x89C9;&#xFF0C;&#x8981;&#x4E48;&#x5C31;&#x662F;&#x957F;&#x65F6;&#x95F4;&#x505A;&#x7BA1;&#x7406;&#xFF0C;&#x7F16;&#x7A0B;&#x5B9E;&#x8DF5;&#x5C11;&#x4E86;&#xFF0C;&#x8981;&#x4E0D;&#x5C31;&#x662F;&#x524D;&#x9762;&#x7684;&#x597D;&#x5370;&#x8C61;&#x90FD;&#x662F;&#x865A;&#x7684;</p>
<h2 id="&#x5E38;&#x89C1;&#x95EE;&#x9898;">&#x5E38;&#x89C1;&#x95EE;&#x9898;</h2>
<ul>
<li>&#x6590;&#x6CE2;&#x90A3;&#x5951;&#x6570;&#x5217;&#xFF0C;&#x8FD9;&#x79CD;&#x95EE;&#x9898;&#x6709;&#x9012;&#x5F52;&#x7248;&#x548C;&#x975E;&#x9012;&#x5F52;&#x7248;&#xFF0C;&#x5982;&#x679C;&#x76F4;&#x63A5;&#x5199;&#x51FA;&#x975E;&#x9012;&#x5F52;&#x7248;&#x90A3;&#x975E;&#x5E38;&#x597D;&#xFF0C;&#x5982;&#x679C;&#x53EA;&#x77E5;&#x9053;&#x9012;&#x5F52;&#x7248;&#xFF0C;&#x5EFA;&#x8BAE;&#x628A;&#x975E;&#x9012;&#x5F52;&#x7248;&#x4E5F;&#x5B66;&#x4E60;&#x4E0B;&#xFF0C;&#x4EFB;&#x4F55;&#x9012;&#x5F52;&#x95EE;&#x9898;&#x57FA;&#x672C;&#x90FD;&#x53EF;&#x4EE5;&#x8F6C;&#x6362;&#x4E3A;&#x975E;&#x9012;&#x5F52;&#xFF0C;&#x6700;&#x597D;&#x5F62;&#x6210;&#x8FD9;&#x79CD;&#x7F16;&#x7A0B;&#x57FA;&#x672C;&#x529F;&#xFF1B;&#x9012;&#x5F52;&#x6709;&#x4EC0;&#x4E48;&#x7F3A;&#x9677;&#x5417;&#xFF1F;&#xFF08;&#x597D;&#x597D;&#x60F3;&#x60F3;&#xFF09;</li>
<li>&#x5BF9;&#x8C61;&#x6DF1;&#x62F7;&#x8D1D;&#x3001;&#x6DF1;&#x6BD4;&#x8F83;&#xFF0C;&#x8FD9;2&#x4E2A;&#x95EE;&#x9898;&#x672C;&#x8D28;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x90FD;&#x4F1A;&#x6D89;&#x53CA;&#x5230;&#x904D;&#x5386;&#xFF0C;&#x5EFA;&#x8BAE;&#x4E0D;&#x719F;&#x6089;DFS&#x548C;BFS&#x7684;&#x597D;&#x597D;&#x5B66;&#x4E60;&#x4E0B;&#xFF0C;&#x5F7B;&#x5E95;&#x638C;&#x63E1;</li>
<li>&#x5192;&#x6CE1;&#x3001;&#x5FEB;&#x901F;&#x6392;&#x5E8F;&#xFF0C;&#x8FD9;&#x4E2A;&#x5C5E;&#x4E8E;&#x7B97;&#x6CD5;&#x8303;&#x56F4;&#xFF0C;&#x4F46;&#x4E5F;&#x5BB9;&#x6613;&#x8981;&#x6C42;&#x5199;&#x4EE3;&#x7801;</li>
<li>&#x4E0D;&#x77E5;&#x9053;&#x5982;&#x4F55;&#x63D0;&#x9AD8;&#x7F16;&#x7A0B;&#x57FA;&#x672C;&#x529F;&#x7684;&#xFF0C;&#x53EF;&#x4EE5;&#x591A;&#x770B;&#x770B;js&#x5F88;&#x591A;&#x57FA;&#x7840;&#x529F;&#x80FD;&#x5E93;&#xFF0C;&#x6BD4;&#x5982;loadsh&#x4E4B;&#x7C7B;&#x7684;&#xFF0C;&#x770B;&#x770B;&#x5B83;&#x4EEC;&#x7684;&#x5DE5;&#x5177;&#x51FD;&#x6570;&#x662F;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x7684;&#xFF0C;&#x7F16;&#x7A0B;&#x9898;&#x4E0D;&#x4EC5;&#x8003;&#x5BDF;&#x4F60;&#x7684;&#x7F16;&#x7A0B;&#x601D;&#x7EF4;&#x3001;&#x7F16;&#x7A0B;&#x57FA;&#x672C;&#x529F;&#xFF0C;&#x8FD8;&#x5F88;&#x5BB9;&#x6613;&#x770B;&#x51FA;js&#x57FA;&#x7840;&#x77E5;&#x8BC6;&#x662F;&#x4E0D;&#x662F;&#x624E;&#x5B9E;&#xFF0C;&#x662F;&#x4E0D;&#x662F;&#x6709;&#x8F6F;&#x808B;</li>
</ul>
<h1 id="node&#xFF08;&#x52A0;&#x5206;&#x9879;&#xFF09;">node&#xFF08;&#x52A0;&#x5206;&#x9879;&#xFF09;</h1>
<p>node&#x5C5E;&#x4E8E;&#x52A0;&#x5206;&#x9879;&#xFF0C;&#x4F46;&#x52A0;&#x5206;&#x7684;&#x524D;&#x63D0;&#x662F;&#x7279;&#x522B;&#x7CBE;&#x901A;&#xFF0C;&#x6709;&#x5B9E;&#x9645;&#x7684;&#x9879;&#x76EE;&#x7ECF;&#x9A8C;&#xFF0C;&#x5982;&#x679C;&#x53EA;&#x662F;&#x7B80;&#x5355;&#x4E86;&#x89E3;&#xFF0C;&#x6700;&#x597D;&#x522B;&#x8BF4;&#x638C;&#x63E1;node&#x4E86;&#xFF0C;&#x5426;&#x5219;&#x8FD8;&#x5BB9;&#x6613;&#x5E26;&#x6765;&#x5B66;&#x800C;&#x4E0D;&#x7CBE;&#x7684;&#x8D1F;&#x9762;&#x5F71;&#x54CD;</p>
<h2 id="&#x5E38;&#x89C1;&#x77E5;&#x8BC6;&#x70B9;">&#x5E38;&#x89C1;&#x77E5;&#x8BC6;&#x70B9;</h2>
<ul>
<li>commonjs&#x6A21;&#x5757;&#x89C4;&#x8303;</li>
<li>&#x6A21;&#x5757;&#x5B9E;&#x73B0;&#x673A;&#x5236;&#x3001;&#x52A0;&#x8F7D;&#x8FC7;&#x7A0B;</li>
<li>&#x5355;&#x7EBF;&#x7A0B;&#x5F02;&#x6B65;&#x7F16;&#x7A0B;&amp;&#x4E8B;&#x4EF6;&#x5FAA;&#x73AF;</li>
<li>&#x5185;&#x5B58;&#x5927;&#x5C0F;&#x9650;&#x5236;&#x539F;&#x56E0;</li>
<li>&#x5806;&#x5185;&#x5B58;&#x548C;&#x975E;&#x5806;&#x5185;&#x5B58;&#xFF08;Buffer&#xFF09;</li>
<li>Buffer&#x8F6C;&#x5B57;&#x7B26;&#x4E32;&#x4E71;&#x7801;&#x95EE;&#x9898;</li>
<li>&#x591A;&#x8FDB;&#x7A0B;&#x67B6;&#x6784;</li>
<li>&#x4F7F;&#x7528;&#x54EA;&#x79CD;&#x6846;&#x67B6;&#xFF0C;egg/koa/express&#xFF0C;&#x638C;&#x63E1;&#x5176;&#x4E2D;&#x4E00;&#x79CD;&#x6846;&#x67B6;&#x7684;&#x4F7F;&#x7528;&#x7EC6;&#x8282;&#xFF0C;&#x6BD4;&#x5982;&#x4E2D;&#x95F4;&#x4EF6;&#x5982;&#x4F55;&#x7F16;&#x5199;</li>
</ul>
<h1 id="&#x7B97;&#x6CD5;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF08;&#x52A0;&#x5206;&#x9879;&#xFF09;">&#x7B97;&#x6CD5;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF08;&#x52A0;&#x5206;&#x9879;&#xFF09;</h1>
<p>&#x5F88;&#x591A;&#x975E;&#x8BA1;&#x7B97;&#x673A;&#x4E13;&#x4E1A;&#x8F6C;&#x578B;&#x7684;&#x524D;&#x7AEF;&#x5BB9;&#x6613;&#x683D;&#x5728;&#x7B97;&#x6CD5;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x8FD9;&#x65B9;&#x9762;&#xFF0C;&#x5EFA;&#x8BAE;&#x6CA1;&#x6709;&#x76F8;&#x5173;&#x77E5;&#x8BC6;&#x79EF;&#x7D2F;&#x7684;&#xFF0C;&#x7CFB;&#x7EDF;&#x6027;&#x5B66;&#x4E60;&#x4E0B;</p>
<h2 id="&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF08;&#x4E00;&#x822C;&#x91CD;&#x8981;&#xFF09;">&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF08;&#x4E00;&#x822C;&#x91CD;&#x8981;&#xFF09;</h2>
<ul>
<li>&#x6808;</li>
<li>&#x961F;&#x5217;</li>
<li>&#x94FE;&#x8868;</li>
<li>&#x4E8C;&#x53C9;&#x6811;</li>
<li>&#x56FE;&#xFF08;&#x8003;&#x5BDF;&#x8F83;&#x5C11;&#xFF09;</li>
</ul>
<h2 id="&#x7B97;&#x6CD5;&#xFF08;&#x6BD4;&#x8F83;&#x91CD;&#x8981;&#xFF09;">&#x7B97;&#x6CD5;&#xFF08;&#x6BD4;&#x8F83;&#x91CD;&#x8981;&#xFF09;</h2>
<ul>
<li>&#x6392;&#x5E8F;&#x7B97;&#x6CD5;&#xFF0C;&#x5192;&#x6CE1;&#x3001;&#x5FEB;&#x901F;&#x6392;&#x5E8F;&#x7684;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#xFF0C;&#x6700;&#x597D;&#x3001;&#x6700;&#x574F;&#x3001;&#x5E73;&#x5747;&#x60C5;&#x51B5;&#x90FD;&#x8981;&#x638C;&#x63E1;&#xFF0C;&#x53E6;&#x5916;&#x8981;&#x505A;&#x5230;&#x80FD;&#x591F;&#x5FEB;&#x901F;&#x7F16;&#x7A0B;&#x5B9E;&#x73B0;&#x8BE5;&#x6392;&#x5E8F;&#x7B97;&#x6CD5;&#xFF0C;&#x5FEB;&#x901F;&#x6392;&#x5E8F;&#x8981;&#x638C;&#x63E1;&#x9012;&#x5F52;&#x548C;&#x975E;&#x9012;&#x5F52;2&#x4E2A;&#x7248;&#x672C;&#x7F16;&#x7A0B;</li>
<li>&#x641C;&#x7D22;&#x7B97;&#x6CD5;&#xFF0C;&#x628A;DFS/BFS&#x597D;&#x597D;&#x5B66;&#x5B66;&#xFF0C;&#x80FD;&#x7F16;&#x7A0B;</li>
</ul>
<h1 id="&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF08;&#x4E00;&#x822C;&#x91CD;&#x8981;&#xFF09;">&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF08;&#x4E00;&#x822C;&#x91CD;&#x8981;&#xFF09;</h1>
<p>&#x5E38;&#x89C1;&#x7684;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x6709;20&#x591A;&#x79CD;&#xFF0C;&#x6709;&#x4E66;&#x7C4D;&#x4F1A;&#x8BB2;&#xFF0C;&#x7CFB;&#x7EDF;&#x6027;&#x5B66;&#x4E60;&#x4E0B;&#xFF0C;&#x6700;&#x597D;&#x662F;&#x6311;&#x51E0;&#x4E2A;&#x524D;&#x7AEF;&#x9879;&#x76EE;&#x5BB9;&#x6613;&#x7528;&#x5230;&#x7684;&#x6A21;&#x5F0F;&#x91CD;&#x70B9;&#x5B66;&#x4E60;&#x4E0B;&#x600E;&#x4E48;&#x5E94;&#x7528;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="vscode.html" class="navigation navigation-prev " aria-label="Previous page: vscode">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="classic.html" class="navigation navigation-next " aria-label="Next page: 一代经典">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"前端知识点","level":"1.4","depth":1,"next":{"title":"一代经典","level":"1.5","depth":1,"path":"classic.md","ref":"classic.md","articles":[]},"previous":{"title":"vscode","level":"1.3","depth":1,"path":"vscode.md","ref":"vscode.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"前端知识点.md","mtime":"2019-06-11T02:19:16.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-01-08T03:14:56.406Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

